samples/SOAP XML/IOS+/OrderPadGetByAccountUpdates_request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <OrderPadGetByAccountUpdates xmlns="http://webservices.iress.com.au/v4/">
      <Input>
        <Header>
          <ServiceSessionKey>A88F5342-1F01-410B-A084-6480D1770925@IDSA01</ServiceSessionKey>
          <RequestID></RequestID>
          <Updates>false</Updates>
          <Timeout>25</Timeout>
          <PageSize>1000</PageSize>
          <WaitForResponse>true</WaitForResponse>
          <PagingBookmark />
          <PagingDirection>0</PagingDirection>
          <InputLocalizationType>0</InputLocalizationType>
          <OutputLocalizationType>0</OutputLocalizationType>
        </Header>
        <Parameters>
          <AccountCodeArray>
            <AccountCode>A001</AccountCode>
          </AccountCodeArray>
          <BackOfficeStatusArray xsi:nil="true" />
          <DestinationArray xsi:nil="true" />
          <DestinationExclude>false</DestinationExclude>
        </Parameters>
      </Input>
    </OrderPadGetByAccountUpdates>
  </soap:Body>
</soap:Envelope>